package com.lsytest.demo.constant;

public class ExcelHeaderContants {
    /**
     * 人资导出模板第一行
     */
    public static final String[] EXCEL_HEADER_HR  = {
            "所属机构（必选）",
            "职位（必选）",
            "职位类型",
            "姓名（必填）",
            "性别（必选）",
            "手机号码（必填）",
            "邮箱",
            "民族",
            "籍贯",
            "身份证号码",
            "通讯地址",
            "身份证有效截止日期",
            "户口性质",
            "婚姻状况",
            "是否为伤残人士",
            "伤残等级",
            "员工状态",
            "入职日期",
            "试用期（月）",
            "转正日期",
            "职级",
            "工资归属",
            "办公地点",
            "第一学历",
            "毕业院校",
            "院校类型",
            "学科专业",
            "毕业时间",
            "毕业证书编号",
            "学位证书编号",
            "最高学历",
            "毕业院校_最高",
            "院校类型_最高",
            "学科专业_最高",
            "毕业时间_最高",
            "毕业证书编号_最高",
            "学位证书编号_最高",
            "职称名称",
            "职称级别",
            "职称编号",
            "职称评定机构",
            "职称批准日期",
            "技能等级证名称",
            "技能等级证级别",
            "技能等级证批准日期",
            "技能等级证编号",
            "发证机构",
            "合同公司",
            "合同起始日期",
            "合同结束日期",
            "合同年限",
            "合同签订次数",
            "紧急联系人姓名",
            "紧急联系人电话",
            "紧急联系人与员工关系"
    };
    /**
     * 人资导出模板第一行
     */
    public static final int EXCEL_HEADER_HR_COLUMNS = EXCEL_HEADER_HR.length;
}
